[
{"addDate": "2021-01-07T08:00:00+00:00", 
 "articleId": "66c8cf954680414993175243599151be",
 "authorsByline": "Brian Flood",
 "categories": [{"name": "Politics"}],
 "claim": "",
 "content": "Civil rights attorney Leo Terrell slammed Democrats on ‘Bill Hemmer Reports’ Thursday for using the tragic events that unfolded at the Capitol to form the basis of talking points meant to blame President Trump for the riot. Violence erupted on Wednesday after Trump spoke at a rally while lawmakers were in the process of counting the Electoral College votes. Trump supporters breached security at the Capitol before entering and vandalizing parts of the building. The intrusion triggered a lockdown and forced lawmakers in the House and Senate to suspend their sessions for roughly six hours. Washington, D.C., police said the unrest left four dead and dozens arrested. On Thursday, Fox News correspondent-at-large Geraldo Rivera blasted Trump for his role in the chaos, saying ‘blood is on the hands’ of the president. ‘The president must man up, he lost this election,’ Rivera said. ‘It’s over, now he has to help calm this country.’ Terrell accused Rivera of parroting ‘Democratic talking points’ and criticized President-elect Biden for saying earlier in the day that Trump was guilty of ‘inciting a mob to attack the Capitol’ when he never told anyone to be violent or destructive. ‘All Donald Trump said yesterday was go down to the Capitol building ... I listened to the Democratic Kool-Aid, you heard Joe Biden today, [Washington D.C. Mayor] Muriel Bowser, they are using this for Democratic talking points,’ Terrell said. ‘All President Trump did, and he has the First Amendment right ... is to express his disappointment. He did not order those individuals to go down there and destroy that Capitol.’ Rivera attempted to interrupt but a heated Terrell wasn’t finished making his point. ‘There were criminals who invaded the Capitol building and they should be prosecuted, but the Democrats sat on their hands during the summer when rioters destroyed Democratic cities,’ Terrell said. ‘For Joe Biden to play the race card today and say that there would have been different treatment for Black protestors, those are criminals. Criminals should be treated one way.’ Terrell maintained that ‘you can’t prosecute’ Trump for simply telling his supporters to go to the Capitol building, a point that Rivera passionately disagreed with. ‘When you light the fuse on a stick of dynamite and it blows up, it is your responsibility,’ Rivera said. ‘Come on now, I’m a lawyer for 30 years. If you go down and say, ‘Go down to the Capitol building and express your disappointment,’ that is not a criminal act,’ Terrell countered. ‘You know that, Geraldo, and the nation knows that. What those people did [to[ go inside the building, damage the property, that is criminal activity. Donald Trump never recommended, suggested or told those people to go in and break into the Capitol building.’ Terrell said Democrats are ‘putting the responsibility of hundreds of thousands of people on the shoulders of Donald Trump because he disagrees with the process,’ and declared it’s not accurate to do so. ‘That’s wrong and that’s not a criminal act,’ he said",
 "country": "us",
 "description": "Capitol riot: Leo Terrell says blaming Trump for destruction is 'Democratic Kool-Aid'  Fox News",
 "entities": [{"data": "Leo Terrell", "mentions": 8, "type": "PERSON"}, {"data": "Trump", "mentions": 11, "type": "PERSON"}, {"data": "Geraldo Rivera", "mentions": 7, "type": "PERSON"}, {"data": "PELOSI", "mentions": 1, "type": "PERSON"}, {"data": "Biden", "mentions": 3, "type": "PERSON"}, {"data": "Muriel Bowser", "mentions": 1, "type": "PERSON"}, {"data": "Democrats", "mentions": 7, "type": "NORP"}, {"data": "Black", "mentions": 1, "type": "NORP"}, {"data": "Bill Hemmer Reports", "mentions": 1, "type": "WORK_OF_ART"}, {"data": "Capitol", "mentions": 9, "type": "FAC"}, {"data": "Electoral College", "mentions": 1, "type": "ORG"}, {"data": "House", "mentions": 1, "type": "ORG"}, {"data": "Senate", "mentions": 1, "type": "ORG"}, {"data": "Fox News", "mentions": 2, "type": "ORG"}, {"data": "roughly six hours", "mentions": 1, "type": "TIME"}, {"data": "earlier in the day", "mentions": 1, "type": "TIME"}, {"data": "Washington", "mentions": 2, "type": "GPE"}, {"data": "D.C.", "mentions": 1, "type": "GPE"}, {"data": "Kool-Aid", "mentions": 1, "type": "PRODUCT"}, {"data": "First Amendment", "mentions": 1, "type": "LAW"}],
 "imageUrl": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/42a82c6e-6ed3-4573-b238-6efe85bb0b00/8ba56aa0-d3d0-4675-89a2-10518943911f/1280x720/match/image.jpg",
 "keywords": [{"name": "Democratic talking points", "weight": 0.09544172}, {"name": "talking points", "weight": 0.08827459}, {"name": "President Trump", "weight": 0.08559324}, {"name": "Capitol", "weight": 0.08234283}, {"name": "Terrell", "weight": 0.080811754}, {"name": "Leo Terrell", "weight": 0.08066686}, {"name": "Trump supporters", "weight": 0.076660275}, {"name": "Donald Trump", "weight": 0.07653278}, {"name": "Geraldo Rivera", "weight": 0.07531708}, {"name": "Trump", "weight": 0.07408812}],
 "labels": [],
 "language": "en",
 "locations": [],
 "medium": "Article",
 "people": "null",
 "places": "null",
 "pubDate": "2021-01-07T08:00:00+00:00",
 "refreshDate": "2021-01-07T08:00:00+00:00",
 "reprint": "false",
 "sentiment": {"negative": 0.7608196, "neutral": 0.21966971, "positive": 0.019510705},
 "source": {"domain": "foxnews.com"},
 "summary": "Civil rights attorney Leo Terrell slammed Democrats on 'Bill Hemmer Reports' Thursday for using the tragic events that unfolded at the Capitol to form the basis of talking points meant to blame President Trump for the riot.Terrell accused Rivera of parroting 'Democratic talking points' and criticized President-elect Biden for saying earlier in the day that Trump was guilty of 'inciting a mob to attack the Capitol' when he never told anyone to be violent or destructive. I listened to the Democratic Kool-Aid, you heard Joe Biden today, [Washington D.C. Mayor] Muriel Bowser, they are using this for Democratic talking points,' Terrell said. Terrell maintained that 'you can't prosecute Trump for simply telling his supporters to go to the Capitol building, a point that Rivera passionately disagreed with.", "title": "Capitol riot: Leo Terrell says blaming Trump for destruction is 'Democratic Kool-Aid'",
 "topics": [{"name": "DNC"}, {"name": "Trump"}],
 "translation": "",
 "url": "https://www.foxnews.com/media/capitol-riots-leo-terrell-blaming-trump-democratic-kool-aid",
 "verdict": ""}
]